export const DataFroggy = [
	{
    id: 1,
		level: 1,
		text: "Добро пожаловать в Flexbox Froggy. Игра, в которой тебе нужно помочь лягушонку Фроги и его друзьям, написав CSS код! Направь этого лягушонка на лилию справа, используя свойство justify-content, которое выравнивает элементы горизонтально и принимает следующие значения:",
		instruction: [
			{
				сondition1:
					"flex-start: элементы выравниваются по левой стороне контейнера.",
				сondition2:
					"flex-end: элементы выравниваются по правой стороне контейнера.",
				сondition3: "center: элементы выравниваются по центру контейнера.",
				сondition4:
					"space-between: элементы отображаются с одинаковыми отступами между ними.",
				сondition5:
					"space-around: элементы отображаются с одинаковыми отступами вокруг них.",
			},
		],
		example: "Например, justify-content: flex-end; сдвинет лягушонка вправо.",
	},
];
