export const DataFroggy = [
	{
		id: 1,
		level: 1,
		text: "Добро пожаловать в Flexbox Froggy. Игра, в которой тебе нужно помочь лягушонку Фроги и его друзьям, написав CSS код! Направь этого лягушонка на лилию справа, используя свойство justify-content, которое выравнивает элементы горизонтально и принимает следующие значения:",
		instruction: [
			{
				сondition1:
					"flex-start: элементы выравниваются по левой стороне контейнера.",
				сondition2:
					"flex-end: элементы выравниваются по правой стороне контейнера.",
				сondition3: "center: элементы выравниваются по центру контейнера.",
				сondition4:
					"space-between: элементы отображаются с одинаковыми отступами между ними.",
				сondition5:
					"space-around: элементы отображаются с одинаковыми отступами вокруг них.",
			},
		],
		example: "Например, justify-content: flex-end; сдвинет лягушонка вправо.",
	},
	{
		id: 2,
		level: 2,
		text: "Используй justify-content ещё раз, чтобы помочь этим лягушатам попасть на их лилии. Помни, что это свойство CSS выравнивает элементы горизонтально и принимает следующие значения:",
		instruction: [
			{
				сondition1:
					"flex-start: элементы выравниваются по левой стороне контейнера.",
				сondition2:
					"flex-end: элементы выравниваются по правой стороне контейнера.",
				сondition3: "center: элементы выравниваются по центру контейнера.",
				сondition4:
					"space-between: элементы отображаются с одинаковыми отступами между ними.",
				сondition5:
					"space-around: элементы отображаются с одинаковыми отступами вокруг них.",
			},
		],
		// example: "Например, justify-content: flex-end; сдвинет лягушонка вправо.",
	},
	{
		id: 3,
		level: 3,
		text: "Помоги всем трём лягушатам найти их лилии, просто используя justify-content. В этот раз у лилий много пространства вокруг.",
		instruction: [
			{
				сondition1:
					"Если ты чувствуешь, что забыл возможные значения свойства, ты можешь навести курсор на название свойства, чтобы посмотреть их. Попробуй навести курсор на justify-content.",
			},
		],
		// example: "Например, justify-content: flex-end; сдвинет лягушонка вправо.",
	},
	{
		id: 4,
		level: 4,
		text: "Теперь лилии по краям уплыли к берегам, увеличив пространство между ними. Используй justify-content. В этот раз у лилий одинаковое расстояние между ними.",
		instruction: [
			{
				сondition1: null,
			},
		],
		// example: "Например, justify-content: flex-end; сдвинет лягушонка вправо.",
	},
	{
		id: 5,
		level: 5,
		text: "Теперь используй align-items, чтобы помочь лягушатам добраться до нижней части пруда. Это свойство CSS выравнивает элементы вертикально и принимает следующие значения:",
		instruction: [
			{
				сondition1:
					"flex-start: элементы выравниваются по верхнему краю контейнера.",
				сondition2:
					"flex-end: элементы выравниваются по нижнему краю контейнера.",
				сondition3:
					"center: элементы выравниваются вертикально по центру контейнера.",
				сondition4:
					"baseline: элементы отображаются на базовой линии контейнера.",
				сondition5:
					"stretch: элементы растягиваются, чтобы заполнить контейнер.",
			},
		],
		// example: "Например, justify-content: flex-end; сдвинет лягушонка вправо.",
	},
	{
		id: 6,
		level: 6,
		text: "Направь лягушонка в центр пруда, используя justify-content и align-items вместе.",
		instruction: [
			{
				сondition1: null,
			},
		],
		// example: "Например, justify-content: flex-end; сдвинет лягушонка вправо.",
	},
	{
		id: 7,
		level: 7,
		text: "Лягушатам снова нужно пересечь пруд. В этот раз к лилиям, с достаточно большим пространством вокруг них. Используй комбинацию justify-content и align-items.",
		instruction: [
			{
				сondition1: null,
			},
		],
		// example: "Например, justify-content: flex-end; сдвинет лягушонка вправо.",
	},
	{
		id: 8,
		level: 8,
		text: "Лягушатам нужно выстроиться в том же порядке, что и лилии, используя flex-direction. Это свойство CSS задает направление, в котором будут расположены элементы в контейнере, и принимает следующие значения:",
		instruction: [
			{
				сondition1: "row: элементы размещаются по направлению текста.",
				сondition2:
					"row-reverse: элементы отображаются в обратном порядке к направлению текста.",
				сondition3: "column: элементы располагаются сверху вниз.",
				сondition4: "column-reverse: элементы располагаются снизу вверх.",
			},
		],
		// example: "Например, justify-content: flex-end; сдвинет лягушонка вправо.",
	},
	{
		id: 9,
		level: 9,
		text: "Помоги лягушатам расположиться на своих лилиях, используя flex-direction. Это свойство CSS задает направление, в котором располагаются элементы в контейнере, и принимает следующие значения:",
		instruction: [
			{
				сondition1: "row: элементы размещаются по направлению текста.",
				сondition2:
					"row-reverse: элементы отображаются в обратном порядке к направлению текста.",
				сondition3: "column: элементы распологаются сверху вниз.",
				сondition4: "column-reverse: элементы распологаются снизу вверх.",
			},
		],
		// example: "Например, justify-content: flex-end; сдвинет лягушонка вправо.",
	},
	{
		id: 10,
		level: 10,
		text: "Помоги лягушатам попасть на свои лилии. Хоть и кажется, что они почти на своих местах, всё же придётся применить и flex-direction, и justify-content, чтобы поместить их на свои лилии.",
		instruction: [
			{
				сondition1:
					"Заметь, что когда ты устанавливаешь направление в обратном порядке для ряда или колонки, начало (start) и конец (end) тоже меняются местами.",
			},
		],
		// example: "Например, justify-content: flex-end; сдвинет лягушонка вправо.",
	},
	{
		id: 11,
		level: 11,
		text: "Помоги лягушатам найти их лилии с помощью flex-direction и justify-content.",
		instruction: [
			{
				сondition1:
					"Заметь, когда в качестве направления выбрана колонка, то justify-content влияет на вертикальное выравнивание, а align-items — на горизонтальное.",
			},
		],
		// example: "Например, justify-content: flex-end; сдвинет лягушонка вправо.",
	},
	{
		id: 12,
		level: 12,
		text: "Помоги лягушатам найти их лилии с помощью flex-direction и justify-content.",
		instruction: [
			{
				сondition1: null,
			},
		],
		// example: "Например, justify-content: flex-end; сдвинет лягушонка вправо.",
	},
];

console.log(DataFroggy[0]);

// export const DataFroggy = [
// 	{
// 		id: 1,
// 		level: 1,
// 		text: "Добро пожаловать в Flexbox Froggy. Игра, в которой тебе нужно помочь лягушонку Фроги и его друзьям, написав CSS код! Направь этого лягушонка на лилию справа, используя свойство justify-content, которое выравнивает элементы горизонтально и принимает следующие значения:",
// 		instruction: [
// 			{
// 				сondition1:
// 					"flex-start: элементы выравниваются по левой стороне контейнера.",
// 				сondition2:
// 					"flex-end: элементы выравниваются по правой стороне контейнера.",
// 				сondition3: "center: элементы выравниваются по центру контейнера.",
// 				сondition4:
// 					"space-between: элементы отображаются с одинаковыми отступами между ними.",
// 				сondition5:
// 					"space-around: элементы отображаются с одинаковыми отступами вокруг них.",
// 			},
// 		],
// 		example: "Например, justify-content: flex-end; сдвинет лягушонка вправо.",
// 	},
// ];
